; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite1 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite2 - satellite
	instrument9 - instrument
	instrument10 - instrument
	satellite3 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	instrument15 - instrument
	satellite4 - satellite
	instrument16 - instrument
	instrument17 - instrument
	instrument18 - instrument
	instrument19 - instrument
	instrument20 - instrument
	instrument21 - instrument
	instrument22 - instrument
	thermograph4 - mode
	image1 - mode
	infrared5 - mode
	thermograph2 - mode
	thermograph3 - mode
	thermograph0 - mode
	thermograph7 - mode
	image6 - mode
	groundstation4 - direction
	groundstation3 - direction
	groundstation1 - direction
	star0 - direction
	groundstation2 - direction
	planet5 - direction
	planet6 - direction
	phenomenon7 - direction
	phenomenon8 - direction
	star9 - direction
	star10 - direction
	star11 - direction
	star12 - direction
	planet13 - direction
	phenomenon14 - direction
	planet15 - direction
	planet16 - direction
	phenomenon17 - direction
	planet18 - direction
	phenomenon19 - direction
	planet20 - direction
	phenomenon21 - direction
	star22 - direction
	planet23 - direction
	phenomenon24 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 image6)
	(calibration_target instrument0 groundstation1)
	(supports instrument1 image6)
	(calibration_target instrument1 groundstation4)
	(supports instrument2 thermograph4)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph7)
	(calibration_target instrument2 groundstation1)
	(supports instrument3 thermograph7)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 groundstation3)
	(supports instrument4 image1)
	(calibration_target instrument4 groundstation3)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 star0)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 groundstation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(on_board instrument4 satellite0)
	(on_board instrument5 satellite0)
	(on_board instrument6 satellite0)
	(power_avail satellite0)
	(pointing satellite0 planet16)
	(supports instrument7 thermograph7)
	(calibration_target instrument7 groundstation2)
	(supports instrument8 thermograph3)
	(supports instrument8 thermograph2)
	(supports instrument8 image1)
	(calibration_target instrument8 groundstation4)
	(on_board instrument7 satellite1)
	(on_board instrument8 satellite1)
	(power_avail satellite1)
	(pointing satellite1 planet23)
	(supports instrument9 image6)
	(calibration_target instrument9 groundstation3)
	(supports instrument10 thermograph4)
	(calibration_target instrument10 groundstation4)
	(on_board instrument9 satellite2)
	(on_board instrument10 satellite2)
	(power_avail satellite2)
	(pointing satellite2 planet20)
	(supports instrument11 thermograph4)
	(calibration_target instrument11 groundstation4)
	(supports instrument12 image1)
	(supports instrument12 thermograph7)
	(calibration_target instrument12 star0)
	(supports instrument13 infrared5)
	(calibration_target instrument13 groundstation3)
	(supports instrument14 image1)
	(calibration_target instrument14 groundstation2)
	(supports instrument15 image1)
	(calibration_target instrument15 groundstation2)
	(on_board instrument11 satellite3)
	(on_board instrument12 satellite3)
	(on_board instrument13 satellite3)
	(on_board instrument14 satellite3)
	(on_board instrument15 satellite3)
	(power_avail satellite3)
	(pointing satellite3 phenomenon19)
	(supports instrument16 image1)
	(calibration_target instrument16 groundstation3)
	(supports instrument17 image1)
	(supports instrument17 thermograph4)
	(supports instrument17 thermograph3)
	(calibration_target instrument17 groundstation3)
	(supports instrument18 image6)
	(supports instrument18 thermograph7)
	(supports instrument18 thermograph3)
	(calibration_target instrument18 groundstation2)
	(supports instrument19 image1)
	(supports instrument19 thermograph0)
	(calibration_target instrument19 groundstation1)
	(supports instrument20 infrared5)
	(supports instrument20 image6)
	(calibration_target instrument20 star0)
	(supports instrument21 thermograph3)
	(supports instrument21 thermograph2)
	(calibration_target instrument21 star0)
	(supports instrument22 image6)
	(supports instrument22 thermograph7)
	(supports instrument22 thermograph0)
	(calibration_target instrument22 groundstation2)
	(on_board instrument16 satellite4)
	(on_board instrument17 satellite4)
	(on_board instrument18 satellite4)
	(on_board instrument19 satellite4)
	(on_board instrument20 satellite4)
	(on_board instrument21 satellite4)
	(on_board instrument22 satellite4)
	(power_avail satellite4)
	(pointing satellite4 phenomenon8)
)
(:goal (and
	(pointing satellite2 star10)
	(pointing satellite3 star12)
	(have_image planet5 image6)
	(have_image planet6 thermograph4)
	(have_image planet6 thermograph0)
	(have_image phenomenon8 thermograph0)
	(have_image phenomenon8 thermograph7)
	(have_image star9 image1)
	(have_image star10 infrared5)
	(have_image star10 image1)
	(have_image star11 infrared5)
	(have_image star11 thermograph3)
	(have_image star12 infrared5)
	(have_image planet13 thermograph3)
	(have_image phenomenon14 thermograph0)
	(have_image phenomenon14 image6)
	(have_image planet15 image1)
	(have_image planet16 image1)
	(have_image phenomenon17 infrared5)
	(have_image phenomenon17 thermograph7)
	(have_image planet18 image1)
	(have_image planet18 infrared5)
	(have_image planet20 thermograph7)
	(have_image phenomenon21 thermograph7)
	(have_image star22 thermograph4)
	(have_image star22 thermograph7)
	(have_image planet23 infrared5)
	(have_image phenomenon24 thermograph4)
	(have_image phenomenon24 thermograph2)
))

)

; plan
1. (switch_on instrument19 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument19)
   goals met: 0 of 29
2. (switch_on instrument13 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument13)
   goals met: 0 of 29
3. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 29
4. (switch_on instrument9 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument9)
   goals met: 0 of 29
5. (switch_on instrument8 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument8)
   goals met: 0 of 29
6. (turn_to satellite3 groundstation3 phenomenon19)
   deleted: (pointing satellite3 phenomenon19)
   added: (pointing satellite3 groundstation3)
   goals met: 0 of 29
7. (calibrate satellite3 instrument13 groundstation3)
   added: (calibrated instrument13)
   goals met: 0 of 29
8. (turn_to satellite3 phenomenon17 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 phenomenon17)
   goals met: 0 of 29
9. (take_image satellite3 phenomenon17 instrument13 infrared5)
   added: (have_image phenomenon17 infrared5)
   goals met: 1 of 29
10. (turn_to satellite3 planet18 phenomenon17)
   deleted: (pointing satellite3 phenomenon17)
   added: (pointing satellite3 planet18)
   goals met: 1 of 29
11. (take_image satellite3 planet18 instrument13 infrared5)
   added: (have_image planet18 infrared5)
   goals met: 2 of 29
12. (turn_to satellite3 planet23 planet18)
   deleted: (pointing satellite3 planet18)
   added: (pointing satellite3 planet23)
   goals met: 2 of 29
13. (take_image satellite3 planet23 instrument13 infrared5)
   added: (have_image planet23 infrared5)
   goals met: 3 of 29
14. (turn_to satellite3 star10 planet23)
   deleted: (pointing satellite3 planet23)
   added: (pointing satellite3 star10)
   goals met: 3 of 29
15. (take_image satellite3 star10 instrument13 infrared5)
   added: (have_image star10 infrared5)
   goals met: 4 of 29
16. (turn_to satellite3 star11 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 star11)
   goals met: 4 of 29
17. (take_image satellite3 star11 instrument13 infrared5)
   added: (have_image star11 infrared5)
   goals met: 5 of 29
18. (turn_to satellite3 star12 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star12)
   goals met: 6 of 29
19. (take_image satellite3 star12 instrument13 infrared5)
   added: (have_image star12 infrared5)
   goals met: 7 of 29
20. (turn_to satellite2 groundstation3 planet20)
   deleted: (pointing satellite2 planet20)
   added: (pointing satellite2 groundstation3)
   goals met: 7 of 29
21. (calibrate satellite2 instrument9 groundstation3)
   added: (calibrated instrument9)
   goals met: 7 of 29
22. (turn_to satellite2 phenomenon14 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 phenomenon14)
   goals met: 7 of 29
23. (take_image satellite2 phenomenon14 instrument9 image6)
   added: (have_image phenomenon14 image6)
   goals met: 8 of 29
24. (turn_to satellite2 planet5 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 planet5)
   goals met: 8 of 29
25. (take_image satellite2 planet5 instrument9 image6)
   added: (have_image planet5 image6)
   goals met: 9 of 29
26. (turn_to satellite2 star10 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 star10)
   goals met: 10 of 29
27. (turn_to satellite1 groundstation4 planet23)
   deleted: (pointing satellite1 planet23)
   added: (pointing satellite1 groundstation4)
   goals met: 10 of 29
28. (calibrate satellite1 instrument8 groundstation4)
   added: (calibrated instrument8)
   goals met: 10 of 29
29. (turn_to satellite1 phenomenon24 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon24)
   goals met: 10 of 29
30. (take_image satellite1 phenomenon24 instrument8 thermograph2)
   added: (have_image phenomenon24 thermograph2)
   goals met: 11 of 29
31. (turn_to satellite1 planet13 phenomenon24)
   deleted: (pointing satellite1 phenomenon24)
   added: (pointing satellite1 planet13)
   goals met: 11 of 29
32. (take_image satellite1 planet13 instrument8 thermograph3)
   added: (have_image planet13 thermograph3)
   goals met: 12 of 29
33. (turn_to satellite1 planet15 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet15)
   goals met: 12 of 29
34. (take_image satellite1 planet15 instrument8 image1)
   added: (have_image planet15 image1)
   goals met: 13 of 29
35. (turn_to satellite1 planet16 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet16)
   goals met: 13 of 29
36. (take_image satellite1 planet16 instrument8 image1)
   added: (have_image planet16 image1)
   goals met: 14 of 29
37. (turn_to satellite1 planet18 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet18)
   goals met: 14 of 29
38. (take_image satellite1 planet18 instrument8 image1)
   added: (have_image planet18 image1)
   goals met: 15 of 29
39. (turn_to satellite1 star10 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 star10)
   goals met: 15 of 29
40. (take_image satellite1 star10 instrument8 image1)
   added: (have_image star10 image1)
   goals met: 16 of 29
41. (turn_to satellite1 star11 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star11)
   goals met: 16 of 29
42. (take_image satellite1 star11 instrument8 thermograph3)
   added: (have_image star11 thermograph3)
   goals met: 17 of 29
43. (turn_to satellite1 star9 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star9)
   goals met: 17 of 29
44. (take_image satellite1 star9 instrument8 image1)
   added: (have_image star9 image1)
   goals met: 18 of 29
45. (turn_to satellite0 groundstation1 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 groundstation1)
   goals met: 18 of 29
46. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 18 of 29
47. (turn_to satellite0 phenomenon17 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon17)
   goals met: 18 of 29
48. (take_image satellite0 phenomenon17 instrument2 thermograph7)
   added: (have_image phenomenon17 thermograph7)
   goals met: 19 of 29
49. (turn_to satellite0 phenomenon21 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon21)
   goals met: 19 of 29
50. (take_image satellite0 phenomenon21 instrument2 thermograph7)
   added: (have_image phenomenon21 thermograph7)
   goals met: 20 of 29
51. (turn_to satellite0 phenomenon24 phenomenon21)
   deleted: (pointing satellite0 phenomenon21)
   added: (pointing satellite0 phenomenon24)
   goals met: 20 of 29
52. (take_image satellite0 phenomenon24 instrument2 thermograph4)
   added: (have_image phenomenon24 thermograph4)
   goals met: 21 of 29
53. (turn_to satellite0 phenomenon8 phenomenon24)
   deleted: (pointing satellite0 phenomenon24)
   added: (pointing satellite0 phenomenon8)
   goals met: 21 of 29
54. (take_image satellite0 phenomenon8 instrument2 thermograph7)
   added: (have_image phenomenon8 thermograph7)
   goals met: 22 of 29
55. (turn_to satellite0 planet20 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet20)
   goals met: 22 of 29
56. (take_image satellite0 planet20 instrument2 thermograph7)
   added: (have_image planet20 thermograph7)
   goals met: 23 of 29
57. (turn_to satellite0 planet6 planet20)
   deleted: (pointing satellite0 planet20)
   added: (pointing satellite0 planet6)
   goals met: 23 of 29
58. (take_image satellite0 planet6 instrument2 thermograph4)
   added: (have_image planet6 thermograph4)
   goals met: 24 of 29
59. (turn_to satellite0 star22 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star22)
   goals met: 24 of 29
60. (take_image satellite0 star22 instrument2 thermograph4)
   added: (have_image star22 thermograph4)
   goals met: 25 of 29
61. (take_image satellite0 star22 instrument2 thermograph7)
   added: (have_image star22 thermograph7)
   goals met: 26 of 29
62. (turn_to satellite4 groundstation1 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 groundstation1)
   goals met: 26 of 29
63. (calibrate satellite4 instrument19 groundstation1)
   added: (calibrated instrument19)
   goals met: 26 of 29
64. (turn_to satellite4 phenomenon14 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 phenomenon14)
   goals met: 26 of 29
65. (take_image satellite4 phenomenon14 instrument19 thermograph0)
   added: (have_image phenomenon14 thermograph0)
   goals met: 27 of 29
66. (turn_to satellite4 phenomenon8 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 phenomenon8)
   goals met: 27 of 29
67. (take_image satellite4 phenomenon8 instrument19 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 28 of 29
68. (turn_to satellite4 planet6 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 planet6)
   goals met: 28 of 29
69. (take_image satellite4 planet6 instrument19 thermograph0)
   added: (have_image planet6 thermograph0)
   goals met: 29 of 29
